import { Question } from '@/types/api'

export const questions: Question[] = [
  {
    id: 0,
    content: 'Интересует ли вас седан?',
  },
  {
    id: 1,
    content: 'Нужен ли вам автомобиль с большим количеством мест?',
  },
  {
    id: 2,
    content: 'Предпочитаете ли вы дизельный двигатель?',
  },
  {
    id: 3,
    content: 'Нужен ли вам автомобиль с малым радиусом разворота?',
  },
  {
    id: 4,
    content: 'Важен ли вам внешний вид автомобиля?',
  },
  {
    id: 5,
    content: 'Важно ли вам, чтобы ваш автомобиль был высокого статуса?',
  },
  {
    id: 6,
    content: 'Нужен ли вам полный привод?',
  },
  {
    id: 7,
    content: 'Интересуют ли вас дополнительные опции, такие как панорамная крыша?',
  },
  {
    id: 8,
    content: 'Важно ли вам наличие встроенной системы навигации?',
  },
  {
    id: 9,
    content: 'Важно ли вам экономичное топливопотребление?',
  },
  {
    id: 10,
    content: 'Важно ли вам большое пространство для багажа?',
  },
  {
    id: 11,
    content: 'Будете ли вы ездить по бездорожью?',
  },
  {
    id: 12,
    content: 'Хотели бы вы, чтобы ваш автомобиль имел парковочные сенсоры?',
  },
  {
    id: 13,
    content: 'Важно ли вам динамичное ускорение?',
  },
  {
    id: 14,
    content: 'Нужен ли вам компактный автомобиль?',
  },
  {
    id: 15,
    content: 'Важно ли наличие системы автоматического торможения?',
  },
  {
    id: 16,
    content: 'Предпочитаете ли вы автоматическую коробку передач?',
  },
  {
    id: 17,
    content: 'Интересует ли вас эксклюзивная марка автомобиля?',
  },
  {
    id: 18,
    content: 'Готовы ли вы тратить много на ремонт и обслуживание?',
  },
  {
    id: 19,
    content: 'Важно ли вам, чтобы ваш автомобиль соответствовал экологическим нормам?',
  },
  {
    id: 20,
    content: 'Интересует ли вас гибридный автомобиль?',
  },
  {
    id: 21,
    content: 'Предпочитаете ли вы автомобиль с подогревом сидений?',
  },
  {
    id: 22,
    content: 'Планируете ли вы использовать систему голосового управления в автомобиле?',
  },
  {
    id: 23,
    content: 'Важно ли вам наличие системы контроля за полосой движения?',
  },
  {
    id: 24,
    content: 'Предпочитаете ли вы автомобиль с системой дистанционного запуска двигателя?',
  },
  {
    id: 25,
    content: 'Важно ли вам наличие системы контроля за температурой в салоне?',
  },
  {
    id: 26,
    content: 'Важно ли вам наличие системы адаптивного круиз-контроля (Adaptive Cruise Control)?',
  },
  {
    id: 27,
    content: 'Предпочитаете ли вы автомобиль с системой регулировки высоты подвески?',
  },
  {
    id: 28,
    content: 'Предпочитаете ли вы автомобиль с системой определения местоположения (GPS)?',
  },
  {
    id: 29,
    content: 'Подходит ли вам семейный автомобиль?',
  },
  {
    id: 30,
    content: 'Интересуют ли вас электромобили?',
  },
]
